html/docker/kubernates-handbook/theory/service/service.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Service</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Service</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgceb49e6">概念</a></li>
<li><a href="#org55dea4f">定义</a>
<ul>
<li><a href="#orgdf2b53f">没有 selector 的 Service</a></li>
</ul>
</li>
<li><a href="#orgfee80c5">VIP 和 Service 代理</a></li>
</ul>
</div>
</div>
<p>
Kubernetes Pod 是有生命周期的，它们可以被创建，也可以被销毁，然而一旦被销毁生命就永远结束。 通过 ReplicationController 能够动态地创建和销毁 Pod
</p>

<pre class="example">
  每个 Pod 都会获取它自己的 IP 地址，即使这些 IP 地址不总是稳定可依赖的

  这会导致一个问题：在 Kubernetes 集群中，如果一组 Pod（称为 backend）为其它 Pod （称为 frontend）提供服务，那么那些 frontend 该如何发现，并连接到这组 Pod 中的哪些 backend 呢？
</pre>
<div id="outline-container-orgceb49e6" class="outline-2">
<h2 id="orgceb49e6">概念</h2>
<div class="outline-text-2" id="text-orgceb49e6">
<p>
Kubernetes Service 定义了这样一种抽象：
</p>
<ul class="org-ul">
<li>一个 <b>Pod</b> 的 <span class="underline">逻辑分组</span></li>
<li>一种可以 <b>访问</b> 它们的 <span class="underline">策略</span> ，通常称为微服务
<ul class="org-ul">
<li>这一组 Pod 能够被 Service 访问到，通常是通过 <span class="underline">Label Selector</span> 实现的</li>
</ul></li>
</ul>

<pre class="example">
举个例子，考虑一个图片处理 backend，它运行了3个副本，这些副本是可互换的，而 frontend 不需要关心它们调用了哪个 backend 副本

然而组成这一组 backend 程序的 Pod 实际上可能会发生变化，frontend 客户端不应该也没必要知道，而且也不需要跟踪这一组 backend 的状态

Service 定义的抽象能够解耦这种关联
</pre>

<ul class="org-ul">
<li>对 Kubernetes 集群中的应用，Kubernetes 提供了简单的 <span class="underline">Endpoints API</span> ，只要 Service 中的一组 <span class="underline">Pod</span> 发生 <b>变更</b> ， <span class="underline">应用程序</span> 就会 <b>被更新</b></li>
<li>对非 Kubernetes 集群中的应用，Kubernetes 提供了基于 <span class="underline">VIP</span> 的 <b>网桥</b> 的方式 <b>访问</b> <span class="underline">Service</span> ，再由 Service  <b>重定向</b> 到 backend Pod</li>
</ul>
</div>
</div>
<div id="outline-container-org55dea4f" class="outline-2">
<h2 id="org55dea4f">定义</h2>
<div class="outline-text-2" id="text-org55dea4f">
<p>
一个 Service 在 Kubernetes 中是一个 <span class="underline">REST 对象</span> ，和 Pod 类似。 像所有的 REST 对象一样， Service 定义可以基于 POST 方式，请求 apiserver 创建新的实例
</p>

<pre class="example">
  例如，假定有一组 Pod，它们对外暴露了 9376 端口，同时还被打上 "app=MyApp" 标签
</pre>

<pre class="example">
kind: Service
apiVersion: v1
metadata:
  name: my-service
spec:
  selector:
    app: MyApp
  ports:
    - protocol: TCP
      port: 80
      targetPort: 9376
</pre>

<p>
上述配置将创建一个名称为 <span class="underline">my-service</span> 的 <b>Service 对象</b> ，它会将请求代理到使用 <span class="underline">TCP</span> 端口 <span class="underline">9376</span> ，并且具有标签 <span class="underline">app=MyApp</span> 的 Pod 上：
</p>
<ul class="org-ul">
<li>这个 Service 将被指派一个 IP 地址（通常称为 <span class="underline">Cluster IP</span> ），它会被 <span class="underline">服务的代理</span> 使用</li>
<li>该 Service 的 selector 将会持续评估，处理结果将被 <span class="underline">POST</span> 到一个名称为 <span class="underline">my-service</span> 的 <b>Endpoints 对象</b> 上</li>
</ul>

<pre class="example">
Service 能够将一个接收端口映射到任意的 targetPort，默认情况下，targetPort 将被设置为与 port 字段相同的值

更有趣的是，targetPort 可以是一个字符串，引用了 backend Pod 的一个端口的名称，但是，实际指派给该端口名称的端口号，在每个 backend Pod 中可能并不相同

对于部署和设计 Service ，这种方式会提供更大的灵活性。例如，可以在 backend 软件下一个版本中，修改 Pod 暴露的端口，并不会中断客户端的调用
</pre>

<p>
Kubernetes Service 支持 <span class="underline">TCP</span> 和 <span class="underline">UDP</span> 协议，默认 TCP 协议 
</p>
</div>
<div id="outline-container-orgdf2b53f" class="outline-3">
<h3 id="orgdf2b53f">没有 selector 的 Service</h3>
<div class="outline-text-3" id="text-orgdf2b53f">
<p>
Service 抽象了该如何访问 Kubernetes Pod，但也能够抽象其它类型的 backend，例如：
</p>
<ul class="org-ul">
<li>希望在生产环境中使用外部的数据库集群，但测试环境使用自己的数据库</li>
<li>希望服务指向另一个 Namespace 中或其它集群中的服务</li>
<li>正在将工作负载转移到 Kubernetes 集群，和运行在 Kubernetes 集群之外的 backend</li>
</ul>

<p>
在任何这些场景中，都能够定义没有 selector 的 Service ：
</p>

<pre class="example">
kind: Service
apiVersion: v1
metadata:
  name: my-service
spec:
  ports:
    - protocol: TCP
      port: 80
      targetPort: 9376
</pre>

<p>
由于这个 Service 没有 selector，就不会创建相关的 Endpoints 对象。可以手动将 Service 映射到指定的 Endpoints：
</p>

<pre class="example">
kind: Endpoints
apiVersion: v1
metadata:
  name: my-service
subsets:
  - addresses:
      - ip: 1.2.3.4
    ports:
      - port: 9376
</pre>

<p>
注意：Endpoint IP 地址不能是 loopback（ <span class="underline">127.0.0.0/8</span> ）、 link-local（ <span class="underline">169.254.0.0/16</span> ）、或者 link-local 多播（ <span class="underline">224.0.0.0/24</span> ）
</p>

<pre class="example">
  访问没有 selector 的 Service，与有 selector 的 Service 的原理相同

  请求将被路由到用户定义的 Endpoint（该示例中为 1.2.3.4:9376）
</pre>

<p>
<span class="underline">ExternalName</span> Service 是 Service 的特例，它没有 selector，也没有定义任何的端口和 Endpoint。相反地，对于运行在集群外部的服务，它通过返回 <span class="underline">该外部服务的别名</span> 这种方式来提供服务：
</p>

<pre class="example">
kind: Service
apiVersion: v1
metadata:
  name: my-service
  namespace: prod
spec:
  type: ExternalName
  externalName: my.database.example.com
</pre>

<p>
当查询主机 my-service.prod.svc.CLUSTER时，集群的 DNS 服务将返回一个值为 <span class="underline">my.database.example.com</span> 的 <span class="underline">CNAME 记录</span> 。访问这个服务的工作方式与其它的相同，唯一不同的是重定向发生在 DNS 层，而且不会进行代理或转发
</p>

<pre class="example">
  如果后续决定要将数据库迁移到 Kubernetes 集群中，可以启动对应的 Pod，增加合适的 Selector 或 Endpoint，修改 Service 的 type
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfee80c5" class="outline-2">
<h2 id="orgfee80c5">VIP 和 Service 代理</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
